{
  "backend/main.mo": "Main canister logic managing user profiles, syllabus items, access control, and gamification state with migration support.",
  "backend/migration.mo": "Migration module converting old gamification state to a new structure including coins and completedChapters.",
  "feature_evidence.json": "Feature evidence report mapping requested features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files detailing their purpose and styling themes.",
  "frontend/.env": "Environment config defining deployment domain for development.",
  "frontend/.env.production": "Production environment config specifying the deployment domain.",
  "frontend/index.css": "Base Tailwind and OKLCH theme variable setup for light and dark mode with color tokens.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level React component handling view navigation between landing, world map, realms, and boss fights.",
  "frontend/src/components/AdventurePortalCard.tsx": "Card component for realm portals with neon styling, subject badges, and hover animations.",
  "frontend/src/components/EarnedXpBadge.tsx": "Badge component displaying earned XP with glowing animated styling.",
  "frontend/src/components/GamificationHeader.tsx": "Displays user gamification stats including level, XP progress, coins, streak, and navigation buttons.",
  "frontend/src/components/HallOfFameLeaderboard.tsx": "Shows a leaderboard dialog with ranked users, pulling XP and profile data and rendering rank icons.",
  "frontend/src/components/MotivationalQuote.tsx": "Empty component file.",
  "frontend/src/components/PowerCard.tsx": "Renders a stylized card with an image slice, title, description, optional icon, and optional action button.",
  "frontend/src/components/StatusBadge.tsx": "Empty component file.",
  "frontend/src/components/SyllabusItemSelector.tsx": "Empty component file.",
  "frontend/src/components/TaskList.tsx": "Empty component file.",
  "frontend/src/components/ThreeDLevelIcon.tsx": "Renders a rotating 3D geometric icon via react-three-fiber with locked and completed indicators.",
  "frontend/src/components/WarMapNode.tsx": "Empty component file.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useGamificationQueries.ts": "Provides queries and mutations for gamification state, leaderboard data, and boss fight completion.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing login, identity persistence, and status.",
  "frontend/src/hooks/useQueries.ts": "Defines syllabus-related queries and mutations for items, tasks, and status updates via the backend actor.",
  "frontend/src/hooks/useUserQueries.ts": "Fetches all user profiles by iterating over gamification states and querying each profile.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, neon effects, utility classes, and animations for the app's visual theme.",
  "frontend/src/lib/bossFights.ts": "Provides predefined boss fight questions for science, maths, and SST with answers and explanations.",
  "frontend/src/lib/confetti.ts": "Implements a simple DOM‑based confetti animation for celebration effects.",
  "frontend/src/lib/contentModel.ts": "Defines subjects and chapters with metadata and exports structured chapter lists for science, maths, and SST.",
  "frontend/src/lib/statusTheme.ts": "Empty placeholder file for status theme logic.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, rendering the main App component.",
  "frontend/src/pages/BossFight.tsx": "Renders interactive boss fight quiz logic with scoring, subject-based styling, XP rewards, and completion UI.",
  "frontend/src/pages/DashboardWarMap.tsx": "Empty placeholder page component.",
  "frontend/src/pages/DivideAndConquer.tsx": "Empty placeholder page component.",
  "frontend/src/pages/PortalHome.tsx": "Displays the main portal landing page with hero visuals and a CTA to start the quest.",
  "frontend/src/pages/PortalMaths.tsx": "Shows the Maths realm portal with power cards and a boss fight CTA themed around the Infinity Dungeon.",
  "frontend/src/pages/PortalScience.tsx": "Science portal page showing themed PowerCards and a boss fight button for starting the Black Hole challenge.",
  "frontend/src/pages/PortalSocialScience.tsx": "Social science portal with historical/geography PowerCards and a boss fight CTA for artifact collection.",
  "frontend/src/pages/RealmCivilizationQuest.tsx": "SST realm page listing kingdoms and chapters, showing completion state and allowing chapter selection.",
  "frontend/src/pages/RealmInfinityDungeon.tsx": "Maths dungeon with 13 linear chapters, unlocking sequentially and showing completion status.",
  "frontend/src/pages/RealmQuantumGalaxy.tsx": "Science realm showing planets and chapters, all unlocked, with selectable mission levels.",
  "frontend/src/pages/WorldMapHub.tsx": "World map hub offering entry into science, maths, or SST realms via styled interactive cards.",
  "frontend/src/utils/deploymentDomain.ts": "Provides validation, sanitization, and fallback logic for deployment domain strings based on length and character rules.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining dark-mode settings, custom colors, animations, and typography for the frontend.",
  "project_state.json": "Project state metadata describing the app’s theme, required assets, architecture, and implemented features."
}