{
  "backend/main.mo": "Actor implementing access control, user profiles, syllabus items, and gamification state with maps and permission checks.",
  "feature_evidence.json": "Report describing implemented UI logo, favicon, and asset-generation features with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend components and pages for reference in build planning.",
  "frontend/.env": "Defines Vite deployment domain for development builds.",
  "frontend/.env.production": "Defines Vite deployment domain for production builds.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables, dark mode overrides, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point setting title and linking favicon and app icon assets generated from the NCW logo.",
  "frontend/src/App.tsx": "Main app controller managing navigation between landing, maps, realms, chapters, boss fights, and showing header/footer.",
  "frontend/src/components/AdventurePortalCard.tsx": "Clickable portal card component with themed colors, image, mission text, and animated hover effects.",
  "frontend/src/components/EarnedXpBadge.tsx": "Badge component displaying earned XP with gold-themed styling and sparkle icons.",
  "frontend/src/components/GamificationHeader.tsx": "Displays the user’s gamification stats (level, XP progress, coins, streak) with navigation and a Hall of Fame button.",
  "frontend/src/components/HallOfFameLeaderboard.tsx": "Shows a modal leaderboard ranking users by XP with profile lookup and rank icons.",
  "frontend/src/components/MotivationalQuote.tsx": "Empty component file.",
  "frontend/src/components/PowerCard.tsx": "Reusable card showing an image slice, title, description, and optional action button or icon.",
  "frontend/src/components/StatusBadge.tsx": "Empty component file.",
  "frontend/src/components/SyllabusItemSelector.tsx": "Empty component file.",
  "frontend/src/components/TaskList.tsx": "Empty component file.",
  "frontend/src/components/ThreeDLevelIcon.tsx": "Renders a rotating 3D geometric icon using react-three-fiber with locked/completed overlays.",
  "frontend/src/components/WarMapNode.tsx": "Empty component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useGamificationQueries.ts": "Provides queries and mutations for gamification state, leaderboard, and completing boss fights.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Contains syllabus-related queries and mutations for fetching items and modifying tasks.",
  "frontend/src/hooks/useUserQueries.ts": "Fetches all user profiles by iterating over gamification states and retrieving individual profiles.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme color variables, and custom neon/glow animations and utility classes for the UI.",
  "frontend/src/lib/bossFights.ts": "Provides fixed boss fight question sets for science, maths, and SST with answers and explanations.",
  "frontend/src/lib/confetti.ts": "Implements a simple DOM‑based confetti animation for celebratory effects.",
  "frontend/src/lib/contentModel.ts": "Defines chapter and subject types and exports structured chapter lists for science, maths, and SST.",
  "frontend/src/lib/statusTheme.ts": "Empty placeholder file for status theme logic.",
  "frontend/src/main.tsx": "App entry point that sets up React rendering with React Query and Internet Identity providers.",
  "frontend/src/pages/BossFight.tsx": "Renders the boss fight quiz flow, scoring, completion logic, and reward UI with confetti.",
  "frontend/src/pages/DashboardWarMap.tsx": "Empty placeholder page for a war‑map style dashboard.",
  "frontend/src/pages/DivideAndConquer.tsx": "Empty placeholder page for Divide and Conquer section.",
  "frontend/src/pages/PortalHome.tsx": "Displays the animated home portal screen with branding, hero section, and start‑quest CTA.",
  "frontend/src/pages/PortalMaths.tsx": "Renders the Maths portal with themed PowerCards and a boss fight CTA. Uses props to trigger the boss fight.",
  "frontend/src/pages/PortalScience.tsx": "Displays the Science portal featuring physics and chemistry PowerCards and a boss fight starter button.",
  "frontend/src/pages/PortalSocialScience.tsx": "Shows the Social Science portal with history and geography PowerCards plus a boss fight CTA.",
  "frontend/src/pages/RealmCivilizationQuest.tsx": "Builds the SST realm view showing kingdoms and chapter cards with completion states and navigation handlers.",
  "frontend/src/pages/RealmInfinityDungeon.tsx": "Implements the linear maths dungeon with sequential chapter unlocking and chapter selection UI.",
  "frontend/src/pages/RealmQuantumGalaxy.tsx": "Creates the science realm with planets, mission chapters, and completion-aware chapter cards.",
  "frontend/src/pages/WorldMapHub.tsx": "React page showing three realm cards (science, maths, sst) with themed visuals and a callback for realm selection.",
  "frontend/src/utils/deploymentDomain.ts": "Utility for validating, sanitizing, and determining a canonical deployment domain based on environment or hostname.",
  "frontend/src/utils/urlParams.ts": "Helpers to read, store, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, fonts, and theme settings for the app.",
  "project_state.json": "Metadata file describing project state, features, pending requests, and icon/image requirements."
}