{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "NCW Adventures logo as UI brand + favicon",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add uploaded logo to frontend public assets under a stable, reusable path.",
      "acceptanceCriteria": [
        "The repository contains the uploaded image copied into frontend/public under a stable path (not dependent on the upload filename).",
        "The logo can be loaded by the browser via a direct /assets/... URL without going through the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/branding/ncw-logo.png",
          "operation": "create",
          "description": "Copy the provided uploaded image (1771343232477.png) into a stable public asset path to serve as the canonical NCW Adventures logo."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show the NCW Adventures logo on the landing page hero and in the global in-app header on non-landing views.",
      "acceptanceCriteria": [
        "On the landing screen, the logo is visible and does not overlap the existing hero content (title, subtitle, CTA).",
        "On non-landing screens, the header shows the logo alongside the existing header controls without breaking layout on mobile.",
        "All logo <img> tags include English alt text (e.g., \"NCW Adventures logo\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PortalHome.tsx",
          "operation": "modify",
          "description": "Add the NCW Adventures logo image (served from frontend/public/assets/branding/ncw-logo.png) near the main heading in the hero layout, with responsive sizing/spacing so it stays visible without overlapping existing content, and include alt text \"NCW Adventures logo\"."
        },
        {
          "path": "frontend/src/components/GamificationHeader.tsx",
          "operation": "modify",
          "description": "Add the NCW Adventures logo image (served from frontend/public/assets/branding/ncw-logo.png) into the header layout so it appears on all non-landing views; ensure the flex/wrapping layout remains usable on mobile and include alt text \"NCW Adventures logo\"."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Wire the logo-derived icon assets as the app favicon/app icons via link tags in index.html.",
      "acceptanceCriteria": [
        "frontend/index.html includes favicon/app icon links pointing to the logo-derived icon files.",
        "When the app is loaded, the browser tab/favicon displays the new NCW Adventures logo (subject to browser caching)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add/update <link rel=\"icon\"> and related icon links to point to the generated icon assets in frontend/public/assets/generated (ncw-favicon.dim_32x32.png, ncw-app-icon.dim_192x192.png, ncw-app-icon.dim_512x512.png) so the browser uses the NCW Adventures logo for the favicon/app icon."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Generate and include required logo-derived favicon/app icon variants as static assets.",
      "acceptanceCriteria": [
        "The icon variants listed in Image Requirements are present in frontend/public/assets/generated with the exact filenames specified.",
        "The generated icons are visually centered and legible at small sizes (especially 32x32)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/ncw-app-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated 512x512 square app icon variant derived from the uploaded NCW logo, centered and optimized for high-resolution app icon use."
        },
        {
          "path": "frontend/public/assets/generated/ncw-app-icon.dim_192x192.png",
          "operation": "create",
          "description": "Add the generated 192x192 square app icon variant derived from the uploaded NCW logo, centered and optimized for PWA/launcher use."
        },
        {
          "path": "frontend/public/assets/generated/ncw-favicon.dim_32x32.png",
          "operation": "create",
          "description": "Add the generated 32x32 favicon variant derived from the uploaded NCW logo, centered and made legible at small sizes."
        }
      ]
    }
  ]
}